gantt			
//the first line is required to define the diagram type

// All lines that begin with "//" are considered as comments and will be 
// ignored when the Gantt chart is made.

// These charts are "dynamic" in that when the current date is within the 
// range of the chart a red vertical line will be drawn on the chart.

// This system has been put together as a simplification of the fully 
// functional Mermaid Gantt chart creator: https://mermaid.js.org/syntax/gantt.html

// Please note the system is still a little buggy and some issues are still outstanding.

// All of the following values need to be entered as tab separated data
// with up to 4 separate values.

// Details start with a few simple settings, which are provided in the form
// Setting Name	Setting Value

// The title will be displayed at the top of the Gantt chart
title	Great Project Title

// The start date defines the beginning of the given project or period of interest
start date	2024-10-01

// The margin is currently applied to the left hand side of the chart in
// order to allow space for the group titles defined below. The value can
// be between 1 - 10 and the actual margin applied will be equal to 
// the value times 50px.
margin	4

// The actual data within the Gantt chart can be added directly in to the
// chart or they can be gathered together in groups
// The Group lines are optional

// A group is begun with a line in the form of:
// group	Group Title or Name
group	WP 1 - Project Management		

// Data rows are formatted as:
// Label Text	Start	End	Formatting
// The Start and End points can simply be a date in the format: YYYY-MM-DD
  // They can also be in the form "No. of months, No. of days" since the start date.
  // So 2 months after the start date would be: 2
  // So 6 months and 15 days after the start date would be: 6,15
  // Also 3 months before the start date would be: -3
  // (negative day and month combinations do not work correctly yet.)
// The formats should be entered as a comma separated list and can include:
  // any combination of: milestone,active,crit,done
// for milestones please enter the same date for start and end
Project Start	0	0	milestone,active,crit
Project preparation	-3	0	
Test 1	0	3	active
Test 2	4,20	8,19	done
Project End	10,3	10,3	milestone,active,crit

// A second example group
group	WP 2 - Active Research		
Test 3	3	7
Test 4	3,12	10,3	active,done
Test 5	3,12	10.3	done

// A thitd example group
group	WP 3 - User engagement
Test 6	5	9
Test 7	6	10	active,done
Test 8	0	10.3	done
